app/Services/Reports/SalesReports.php

SELECT COUNT(*) as transactions, COALESCE(SUM(total), 0) as total_sales, COALESCE(SUM(total_discount), 0) as discount_total, COALESCE(SUM(total_tax), 0) as tax_total
FROM `pos_sales`
WHERE `store_id` = '2'
AND DATE(created_at) >= '2025-10-27'
AND DATE(created_at) <= '2025-10-31'
---
    public function getSummary(array $filters = []): array
    {
        list($storeId, $start, $end) = $this->baseFilters($filters);
        $cache = Services::cache();
        $cacheKey = 'rep_sales_summary_' . md5(json_encode([$storeId, $start, $end]));
        if ($cached = $cache->get($cacheKey)) {
            // If cached result is empty returns (all zeros), bypass to allow fresh data soon after returns are recorded
            if (($cached['returns_total'] ?? 0) > 0 || ($cached['returns_qty'] ?? 0) > 0 || ($cached['returns_count'] ?? 0) > 0 || ($cached['transactions'] ?? 0) > 0) {
                $cached['cached'] = true;
                return $cached;
            }
        }

        $builder = $this->db->table('pos_sales');
        $builder->select('COUNT(*) as transactions, COALESCE(SUM(total),0) as gross_sales, COALESCE(SUM(total_discount),0) as discount_total, COALESCE(SUM(total_tax),0) as tax_total');
        if ($storeId !== null) {
            $builder->where('store_id', $storeId);
        }
        $builder->where('created_at >=', $start . ' 00:00:00')
            ->where('created_at <=', $end . ' 23:59:59');
        $row = $builder->get()->getRowArray() ?? [];
        $transactions = (int)($row['transactions'] ?? 0);
        $grossSales = (float)($row['gross_sales'] ?? 0);

        // Returns in the same period (by return date)
        $ret = $this->db->table('pos_sales_returns r')
            ->select('COALESCE(SUM(r.return_amount),0) as returns_total, COALESCE(SUM(r.quantity),0) as returns_qty, COUNT(*) as returns_count')
            ->where('r.created_at >=', $start . ' 00:00:00')
            ->where('r.created_at <=', $end . ' 23:59:59');