app/Services/Reports/SalesReports.php

SELECT COALESCE(SUM(si.subtotal), 0) as revenue, COALESCE(SUM(si.cost_price * si.quantity), 0) as cogs
FROM `pos_sale_items` `si`
JOIN `pos_sales` `s` ON `s`.`id` = `si`.`sale_id`
WHERE DATE(s.created_at) >= '2025-11-01'
AND DATE(s.created_at) <= '2025-11-05'
AND `s`.`store_id` = '2'
---
    public function getMarginSummary(array $filters = []): array
    {
        [$storeId, $start, $end] = $this->baseFilters($filters);
        $builder = $this->db->table('pos_sale_items si');
        $builder->select('COALESCE(SUM(si.subtotal),0) as revenue, COALESCE(SUM(si.cost_price * si.quantity),0) as cogs')
            ->join('pos_sales s', 's.id = si.sale_id')
            ->where('DATE(s.created_at) >=', $start)
            ->where('DATE(s.created_at) <=', $end);
        if ($storeId !== null) {
            $builder->where('s.store_id', $storeId);
        }
        $row = $builder->get()->getRowArray() ?? ['revenue' => 0, 'cogs' => 0];