app/Helpers/audit_helper.php

function logAction($action, $details = '')
{
    $model = new \App\Models\M_audit_logs();
    $model->insert([
        'user_id' => session('user_id'),
        'action' => $action,
        'details' => $details,
        'ip_address' => service('request')->getIPAddress(),
        'user_agent' => service('request')->getUserAgent(),
        'store_id' => session('store_id'),
    ]);
---
INSERT INTO `audit_logs` (`user_id`, `action`, `details`, `ip_address`, `user_agent`, `store_id`) VALUES ('1', 'sale_created', 'Sale ID: 80, InvoiceNo: S1-20251030-0010, Customer ID: 3, Total: 550.00', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/141.0.0.0 Safari/537.36', '1')