app/Controllers/BaseController.php

SELECT *
FROM `pos_stores`
WHERE `pos_stores`.`id` = '1'
---
    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        $supportedLocales = config('App')->supportedLocales ?? ['en'];
        $sessionLocale = (string) session('locale');
        $activeLocale = in_array($sessionLocale, $supportedLocales, true)
            ? $sessionLocale
            : (config('App')->defaultLocale ?? 'en');

        if ($request instanceof IncomingRequest) {
            $request->setLocale($activeLocale);
        }
        service('language')->setLocale($activeLocale);

        // Preload any models, libraries, etc, here.

        // E.g.: $this->session = service('session');

        // Per-store timezone: if a store is selected, set PHP timezone to the store's timezone
        try {
            $storeId = session()->get('store_id');
            if (!empty($storeId)) {
                $storeModel = new \App\Models\StoreModel();
                $store = $storeModel->find($storeId);