app/Controllers/Customers.php

SELECT COUNT(*) AS `numrows`
FROM `pos_customers`
WHERE `store_id` = '1'
---
    public function index()
    {
        $model = new M_customers();
        $storeId = session('store_id');

        $totalCustomers = $model->forStore($storeId)
            ->countAllResults();