app/Controllers/Dashboard.php

SELECT *
FROM `pos_sales`
WHERE `store_id` = '2'
ORDER BY `created_at` DESC
 LIMIT 5
---
    protected function getRecentSales($limit = 5)
    {
        return $this->saleModel
            ->orderBy('created_at', 'DESC')
            ->limit($limit)
            ->forStore()->findAll();

SELECT `username`, `updated_at` AS `last_login`
FROM `pos_users`
WHERE `updated_at` IS NOT NULL
AND `store_id` = '2'
ORDER BY `updated_at` DESC
 LIMIT 5
---
    protected function getUserActivity($limit = 5)
    {
        // This would require an activity log table
        // For now, we'll return recent logins
        return $this->userModel
            ->select('username, updated_at AS last_login')
            ->where('updated_at IS NOT NULL')
            ->orderBy('updated_at', 'DESC')
            ->limit($limit)
            ->forStore()->findAll();