app/Controllers/ExpenseCategories.php

    public function index()
    {
        $model = new ExpenseCategoryModel();
        $categories = $model->forStore()->orderBy('name', 'ASC')->findAll();
---
SELECT *
FROM `pos_expense_categories`
WHERE `store_id` = '1'
ORDER BY `name` ASC

    public function create()
    {
        $model = new ExpenseCategoryModel();
        $data = $this->request->getPost();
        $data['store_id'] = session('store_id');
        if (!$model->insert($data)) {
---
INSERT INTO `pos_expense_categories` (`name`, `description`, `store_id`, `created_at`, `updated_at`) VALUES ('Travel', '', '1', '2025-11-06 00:10:59', '2025-11-06 00:10:59')