app/Controllers/Expenses.php

SELECT *
FROM `pos_expense_categories`
WHERE `store_id` = '1'
ORDER BY `name` ASC
---
    public function index()
    {
        // Load categories for filters
        $db = \Config\Database::connect();
        $storeId = session('store_id');
        $catBuilder = $db->table('pos_expense_categories');
        if ($storeId !== null) $catBuilder->where('store_id', $storeId);
        $categories = $catBuilder->orderBy('name', 'ASC')->get()->getResultArray();

SELECT *
FROM `pos_expenses`
WHERE `store_id` = '1'
AND `pos_expenses`.`id` = '1'
SELECT *
FROM `pos_expense_categories`
WHERE `store_id` = '1'
ORDER BY `name` ASC
---
    public function edit($id)
    {
        $model = new ExpenseModel();
        $expense = $model->forStore()->find($id);
        if (!$expense) return redirect()->to(site_url('expenses'))->with('error', 'Not found');
        // categories
        $db = \Config\Database::connect();
        $cat = $db->table('pos_expense_categories');
        if ($expense['store_id'] !== null) $cat->where('store_id', $expense['store_id']);
        $categories = $cat->orderBy('name', 'ASC')->get()->getResultArray();

SELECT *
FROM `pos_expenses`
WHERE `store_id` = '1'
AND `pos_expenses`.`id` = '1'
UPDATE `pos_expenses` SET `date` = '2025-11-05', `category_id` = '1', `vendor` = 'Vendro', `amount` = '100.00', `tax` = '15.00', `description` = '', `notes` = '', `updated_at` = '2025-11-06 00:11:11'
WHERE `pos_expenses`.`id` IN ('1')
---
    public function update($id)
    {
        $model = new ExpenseModel();
        $expense = $model->forStore()->find($id);
        if (!$expense) return redirect()->to(site_url('expenses'))->with('error', 'Not found');

        $data = $this->request->getPost();

        // Optional receipt replace
        $file = $this->request->getFile('receipt');
        if ($file && $file->isValid()) {
            $targetDir = FCPATH . 'uploads/expenses/';
            if (!is_dir($targetDir)) {
                @mkdir($targetDir, 0777, true);
            }
            $newName = $file->getRandomName();
            if ($file->move($targetDir, $newName)) {
                $data['receipt_path'] = 'uploads/expenses/' . $newName;
            }
        }

        if (!$model->update($id, $data)) {