app/Controllers/Products.php

SELECT `id`, `name`, `cost_price`, `price`, `quantity`, `carton_size`, IFNULL(description, "") as description, `code`, `barcode`
FROM `pos_products`
WHERE `store_id` = '1'
ORDER BY `id` DESC
 LIMIT 25
---
    public function barcode()
    {
        $barcode = $this->request->getGet('barcode');
        $model = new \App\Models\M_products();
        $product = $model->where('barcode', $barcode)
            ->select('id, name, code, cost_price, price, quantity, carton_size, max_discount_value, max_discount_type')
            ->forStore()
            ->first();