app/Controllers/Products.php

SELECT `id`, `name`, `code`, `barcode`, `cost_price`, `price`, `quantity`, `carton_size`
FROM `pos_products`
WHERE   (
`name` LIKE '%another pro%' ESCAPE '!'
OR  `code` LIKE '%another pro%' ESCAPE '!'
OR  `barcode` LIKE '%another pro%' ESCAPE '!'
 )
AND `store_id` = '1'
ORDER BY `name` ASC
 LIMIT 50
---
    public function search($keyword = '')
    {
        // Get search term from query parameter 'q' or URL segment
        $q = $this->request->getGet('q') ?? $keyword;

        $model = new \App\Models\M_products();

        // Require minimum 1 character to search (performance optimization for large datasets)
        if (empty($q) || strlen(trim($q)) < 1) {
            // Return empty array or top 20 products
            $products = $model->select('id, name, code, barcode, cost_price, price, quantity, carton_size')
                ->forStore()
                ->orderBy('name', 'ASC')
                ->limit(20)
                ->findAll();
        } else {
            // Search by name, code, or barcode with optimized query
            $products = $model->groupStart()
                ->like('name', $q)
                ->orLike('code', $q)
                ->orLike('barcode', $q)
                ->groupEnd()
                ->select('id, name, code, barcode, cost_price, price, quantity, carton_size')
                ->forStore()
                ->orderBy('name', 'ASC')
                ->limit(50)
                ->findAll();

SELECT `id`, `name`, `code`, `cost_price`, `price`, `quantity`, `carton_size`
FROM `pos_products`
WHERE `barcode` = '3'
AND `store_id` = '1'
 LIMIT 1
---
    public function barcode()
    {
        $barcode = $this->request->getGet('barcode');
        $model = new \App\Models\M_products();
        $product = $model->where('barcode', $barcode)
            ->select('id, name, code, cost_price, price, quantity, carton_size')
            ->forStore()
            ->first();

SELECT COUNT(*) AS `numrows`
FROM `pos_products`
WHERE `store_id` = '1'
---
    public function datatable()
    {
        if (!$this->request->isAJAX()) {
            return $this->response->setStatusCode(400)->setJSON([
                'error' => 'Invalid request',
            ]);
        }

        $draw = (int) $this->request->getVar('draw');
        $start = (int) $this->request->getVar('start');
        $length = (int) $this->request->getVar('length');
        $length = $length > 0 ? min($length, 200) : 25; // guard against huge page sizes

        $search = $this->request->getVar('search')['value'] ?? '';
        $orderRequest = $this->request->getVar('order')[0] ?? null;

        // Map DataTables column indexes to database columns.
        // Must align with the client-side columns array in products/index.php:
        // 0: (checkbox), 1: id, 2: name, 3: code, 4: barcode, 5: cost_price, 6: price, 7: quantity, 8: (actions)
        $columns = ['', 'id', 'name', 'code', 'barcode', 'cost_price', 'price', 'quantity', ''];

        $db = \Config\Database::connect();
        $storeId = session('store_id');

        $baseBuilder = $db->table('pos_products')->where('store_id', $storeId);

        $totalRecords = (clone $baseBuilder)->countAllResults();