app/Controllers/Purchases.php

SELECT COALESCE(SUM(grand_total), 0) AS total_grand, COALESCE(SUM(paid_amount), 0) AS total_paid
FROM `pos_purchases`
WHERE `store_id` = '1'
---
    public function index()
    {
        $db = \Config\Database::connect();
        $storeId = session('store_id');

        $summaryBuilder = $db->table('pos_purchases')
            ->select('COALESCE(SUM(grand_total), 0) AS total_grand, COALESCE(SUM(paid_amount), 0) AS total_paid');

        if ($storeId !== null) {
            $summaryBuilder->where('store_id', $storeId);
        }

        $summary = $summaryBuilder->get()->getRowArray();

SELECT *
FROM `pos_suppliers`
WHERE `store_id` = '1'
SELECT *
FROM `pos_products`
WHERE `store_id` = '1'
SELECT *
FROM `settings`
 LIMIT 1
---
    public function create()
    {
        $settingModel = new \App\Models\SettingsModel();

        $data = [
            'title' => 'Create New Purchase',
            'suppliers' => $this->supplierModel->forStore()->findAll(),
            'products' => $this->productModel->forStore()->findAll(),
            'taxes' => [], //$this->taxModel->findAll(),
            'invoice_no' => $this->purchaseModel->generatePurchaseInvoiceNo(), //['data']['invoice_no'],
            'today' => date('Y-m-d H:i:s'),
            'taxRate' => $settingModel->first()['tax_rate'] ?? 0,
            'imeiTrackingEnabled' => function_exists('business_feature_enabled') ? business_feature_enabled('imei_tracking') : false,
            'expiryTrackingEnabled' => function_exists('business_feature_enabled') ? business_feature_enabled('expiry_tracking') : false,
        ];