app/Controllers/Receipts.php

    public function generate($saleId)
    {
        // Get sale data from database
        $sale = $this->M_sales->getSaleData($saleId);
        if (!$sale) {
            return redirect()->back()->with('error', 'Sale not found.');
        }

        // Get receipt template
        $template = $this->templateModel->getDefaultTemplate();
        if (!$template) {
            return redirect()->back()->with('error', 'Receipt template not found.');
        }

        $loggedInStore = $this->M_stores->find(session()->get('store_id'));
---
SELECT *
FROM `pos_stores`
WHERE `pos_stores`.`id` = '1'