app/Controllers/Sales.php

SELECT *
FROM `pos_customers`
WHERE `pos_customers`.`id` = '6'
---
                    $points = (int) floor(((float)$total) / 1000);
                    if ($points > 0 && $customer_id) {
                        $customerModel = new \App\Models\M_customers();
                        $customer = $customerModel->forStore()->find($customer_id);