app/Controllers/Sales.php

    public function index()
    {
        $salesModel = new M_sales();
        $totalDueRow = $salesModel->selectSum('due_amount', 'due_total')
            ->forStore()
            ->first();
---
SELECT SUM(`due_amount`) AS `due_total`
FROM `pos_sales`
WHERE `store_id` = '1'
 LIMIT 1

        // Walk-in customer handling: create/find default Walk-in per store when not selected
        if (!$customer_id) {
            $storeId = session('store_id') ?? 0;
            $walkin = $this->customerModel->where('store_id', $storeId)->where('name', 'Walk-in Customer')->first();
---
SELECT *
FROM `pos_customers`
WHERE `store_id` = '1'
AND `name` = 'Walk-in Customer'
 LIMIT 1

                        'due_amount' => $due_amount ?? 0,
                        'created_at' => date('Y-m-d H:i:s')
                    ];
                    $sale_id = $salesModel->insert($saleData);
---
INSERT INTO `pos_sales` (`customer_id`, `total`, `total_discount`, `discount_type`, `created_at`, `payment_method`, `store_id`, `user_id`, `invoice_no`, `total_tax`, `amount_tendered`, `change_amount`, `employee_id`, `commission_amount`, `status`, `payment_type`, `payment_status`, `due_amount`, `updated_at`) VALUES ('6', '600.00', 0, 'fixed', '2025-11-06 23:36:54', 'cash', '1', '1', 'S1-20251106-0009', '0.00', 0, 0, 0, 0, 'completed', 'cash', 'paid', 0, '2025-11-06 23:36:54')


                // Insert items and adjust inventory
                foreach ($items as $item) {
                    $product = $productModel->find($item['id']);
                    if ($product) { //&& $product['quantity'] >= $item['quantity']
                        $saleItemsModel->insert([
                            'sale_id' => $sale_id,
                            'product_id' => $item['id'],
                            'quantity' => $item['quantity'],
                            'price' => $item['price'],
                            'cost_price' => $item['cost_price'],
                            'subtotal' => $item['price'] * $item['quantity'],
                        ]);
---
SELECT *
FROM `pos_products`
WHERE `pos_products`.`id` = '9083'
INSERT INTO `pos_sale_items` (`sale_id`, `product_id`, `quantity`, `price`, `cost_price`, `subtotal`) VALUES (18, '9083', 2, 300, '231.2500', 600)

    public function delete($saleId)
    {
        $salesModel = new M_sales();
        $saleItemsModel = new M_sale_items();
        $inventoryModel = new M_inventory();
        $ledgerModel = new \App\Models\CustomerLedgerModel();

        // Start transaction
        $db = $salesModel->db;
        $db->transStart();

        // Get sale details
        $sale = $salesModel->find($saleId);
        if (!$sale) {
            $db->transRollback();
            return redirect()->to(site_url('sales'))->with('error', 'Sale not found.');
        }

        // Delete sale items and restore stock
        $items = $saleItemsModel->where('sale_id', $saleId)->findAll();
        foreach ($items as $item) {
            $productModel = new M_products();
            if (!$productModel->adjustStock($item['product_id'], $item['quantity'], 'in')) {
                $db->transRollback();
                return redirect()->to(site_url('sales'))->with('error', 'Failed to restore stock for product ID: ' . $item['product_id']);
            }

            if (!$inventoryModel->logStockChange(
                $item['product_id'],
                session()->get('user_id'),
                $item['quantity'],
                'in',
                session('store_id') ?? '',
                "Sale #{$saleId} deleted - Restoring stock. Invoice No: " . ($sale['invoice_no'] ?? '') . ". Total: " . ($sale['total'] ?? 0),
                0,
                0,
                $sale['invoice_no'] ?? '',
                date('Y-m-d H:i:s')
            )) {
---
SELECT *
FROM `pos_sales`
WHERE `store_id` = '1'
AND `pos_sales`.`id` = '145'

    public function exportUnitReportPDF()
    {
        $dateParam = $this->request->getGet('date');
        $from = $this->request->getGet('from') ?? $dateParam ?? date('Y-m-d');
        $to = $this->request->getGet('to') ?? $dateParam ?? date('Y-m-d');
        $employeeId = $this->request->getGet('employee_id');
        if ($from > $to) {
            $tmp = $from;
            $from = $to;
            $to = $tmp;
        }
        $storeId = session('store_id');
        $saleItemsModel = new \App\Models\M_sale_items();

        $builder = $saleItemsModel
            ->select('pos_units.name as unit_name, pos_units.abbreviation, SUM(pos_sale_items.quantity) as total_qty, SUM(pos_sale_items.subtotal) as total_sales, COUNT(DISTINCT pos_sales.id) as sale_count')
            ->join('pos_sales', 'pos_sales.id = pos_sale_items.sale_id')
            ->join('pos_products', 'pos_products.id = pos_sale_items.product_id', 'left')
            ->join('pos_units', 'pos_units.id = pos_products.unit_id', 'left')
            ->where('pos_sales.created_at >=', $from . ' 00:00:00')
            ->where('pos_sales.created_at <=', $to . ' 23:59:59')
            ->where('pos_sales.store_id', $storeId);
        if (!empty($employeeId)) {
            $builder->where('pos_sales.employee_id', (int)$employeeId);
        }
        $rows = $builder->groupBy('pos_units.id')->orderBy('total_sales', 'DESC')->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `pos_sales`
WHERE `store_id` = '1'