app/Controllers/Suppliers.php

SELECT COUNT(*) AS `numrows`
FROM `pos_suppliers` `s`
WHERE `s`.`store_id` = '1'
---
    public function datatable()
    {
        if (!$this->request->isAJAX()) {
            return $this->response->setStatusCode(400)->setJSON(['error' => 'Invalid request.']);
        }

        $draw = (int) ($this->request->getVar('draw') ?? 0);
        $start = max(0, (int) ($this->request->getVar('start') ?? 0));
        $length = (int) ($this->request->getVar('length') ?? 25);
        $length = $length > 0 ? min($length, 200) : 25;

        $search = $this->request->getVar('search')['value'] ?? '';
        $orderRequest = $this->request->getVar('order')[0] ?? null;

        $columns = [
            's.id',
            's.name',
            's.email',
            's.phone',
            's.address',
            's.created_at',
        ];

        $db = \Config\Database::connect();
        $storeId = session('store_id');

        $baseBuilder = $db->table('pos_suppliers s');
        if ($storeId !== null) {
            $baseBuilder->where('s.store_id', $storeId);
        }
        $totalRecords = (clone $baseBuilder)->countAllResults();