app/Models/M_products.php

    public function adjustStock($productId, $quantity, $type = 'adjustment')
    {
        $product = $this->find($productId);
        if (!$product) {
            return false; // product not found
        }

        // Skip stock adjustment if this is a service or explicitly not tracked
        if ((isset($product['type']) && $product['type'] === 'service') || (isset($product['is_stock_tracked']) && (int)$product['is_stock_tracked'] === 0)) {
            return true; // treat as successful no-op
        }

        if ($type === 'in') {
            $newQuantity = $product['quantity'] + $quantity;
        } elseif ($type === 'out') {
            $newQuantity = $product['quantity'] - $quantity;
        } else {
            $newQuantity = $quantity; // direct set
        }

        return $this->update($productId, ['quantity' => $newQuantity]);
---
UPDATE `pos_products` SET `quantity` = 971, `updated_at` = '2025-10-30 16:05:31'
WHERE `pos_products`.`id` IN ('4')