app/Models/M_products.php

SELECT *
FROM `pos_products`
WHERE `pos_products`.`id` = '9083'
---
    public function getProducts($productID = false)
    {
        if ($productID === false) {
            return $this->forStore()->findAll();
        }

        return $this->where(['id' => $productID])->forStore()->first();

UPDATE `pos_products` SET `quantity` = 25, `updated_at` = '2025-11-06 23:36:54'
WHERE `pos_products`.`id` IN ('9083')
---
    public function adjustStock($productId, $quantity, $type = 'adjustment')
    {
        $product = $this->find($productId);
        if (!$product) {
            return false; // product not found
        }

        // Skip stock adjustment if this is a service or explicitly not tracked
        if ((isset($product['type']) && $product['type'] === 'service') || (isset($product['is_stock_tracked']) && (int)$product['is_stock_tracked'] === 0)) {
            return true; // treat as successful no-op
        }

        if ($type === 'in') {
            $newQuantity = $product['quantity'] + $quantity;
        } elseif ($type === 'out') {
            $newQuantity = $product['quantity'] - $quantity;
        } else {
            $newQuantity = $quantity; // direct set
        }

        return $this->update($productId, ['quantity' => $newQuantity]);