app/Models/M_sales.php

SELECT `pos_sales`.*, `pos_users`.`name` as `cashier_name`, `pos_customers`.`name` as `customer_name`
FROM `pos_sales`
LEFT JOIN `pos_users` ON `pos_users`.`id` = `pos_sales`.`user_id`
LEFT JOIN `pos_customers` ON `pos_customers`.`id` = `pos_sales`.`customer_id`
WHERE `pos_sales`.`id` = '18'
 LIMIT 1
SELECT `pos_sale_items`.*, `pos_products`.`name`, `pos_products`.`carton_size`
FROM `pos_sale_items`
JOIN `pos_products` ON `pos_products`.`id` = `pos_sale_items`.`product_id`
WHERE `pos_sale_items`.`sale_id` = '18'
---
    public function getSaleData($saleId)
    {
        // Implement your sale data retrieval here
        // This is a simplified example
        $sale = $this->select('pos_sales.*, pos_users.name as cashier_name,
        pos_customers.name as customer_name, pos_customers.address as customer_address, pos_customers.phone as customer_phone,
        pos_customers.zatca_registration_name, pos_customers.zatca_cr_number, pos_customers.vat_number,
        pos_customers.zatca_street_name, pos_customers.zatca_building_number, pos_customers.zatca_city_subdivision_name,
        pos_customers.zatca_city_name, pos_customers.zatca_postal_code, pos_customers.zatca_country_code,
        pos_employees.phone as employee_phone,pos_employees.name as employee_name')
            ->join('pos_users', 'pos_users.id = pos_sales.user_id', 'left')
            ->join('pos_customers', 'pos_customers.id = pos_sales.customer_id', 'left')
            ->join('pos_employees', 'pos_employees.id = pos_sales.employee_id', 'left')
            ->where('pos_sales.id', $saleId)
            ->first();

        $sale['items'] = $this->db->table('pos_sale_items')
            ->select('pos_sale_items.*, pos_products.name, pos_products.carton_size')
            ->join('pos_products', 'pos_products.id = pos_sale_items.product_id')
            ->where('pos_sale_items.sale_id', $saleId)
            ->get()
            ->getResultArray();