app/Models/PurchaseModel.php

    public function getPurchasesWithSupplier($conditions = [])
    {
        $builder = $this->db->table('pos_purchases p');
        $builder->select('p.*, s.name as supplier_name, u.username as user_id_name');
        $builder->join('pos_suppliers s', 's.id = p.supplier_id', 'left');
        $builder->join('pos_users u', 'u.id = p.user_id', 'left');
        $builder->where('p.store_id', session()->get('store_id'));

        if (!empty($conditions)) {
            $builder->where($conditions);
        }

        $builder->orderBy('p.date', 'DESC');
        return $builder->get()->getResultArray();
---
SELECT *
FROM `pos_purchases`
WHERE `store_id` = '1'
AND `pos_purchases`.`id` = '37'

    public function getPurchaseWithDetails($id)
    {
        // Get purchase header
        $purchase = $this->forStore()->find($id);
        if (!$purchase) return null;

        // Get supplier details
        $supplierModel = new \App\Models\SuppliersModel();
        $purchase['supplier'] = $supplierModel->find($purchase['supplier_id']);

        // Get store details
        $storeModel = new \App\Models\StoreModel();
        $purchase['store'] = $storeModel->find($purchase['store_id']);

        // Get creator details
        $userModel = new \App\Models\UserModel();
        $purchase['creator'] = $userModel->find($purchase['user_id']);

        // Get items
        $purchase['items'] = $this->db->table('pos_purchase_items pi')
            ->select('pi.*, p.name as product_name, p.code as product_code, p.carton_size')
            ->join('pos_products p', 'p.id = pi.product_id', 'left')
            ->where('pi.purchase_id', $id)
            ->get()
            ->getResultArray();

        // Get payments
        $purchase['payments'] = $this->db->table('pos_purchase_payments')
            ->where('purchase_id', $id)
            ->orderBy('payment_date', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `pos_suppliers`
WHERE `pos_suppliers`.`id` = '2'
SELECT *
FROM `pos_stores`
WHERE `pos_stores`.`id` = '1'
SELECT *
FROM `pos_users`
WHERE `pos_users`.`id` = '1'
SELECT `pi`.*, `p`.`name` as `product_name`, `p`.`code` as `product_code`
FROM `pos_purchase_items` `pi`
LEFT JOIN `pos_products` `p` ON `p`.`id` = `pi`.`product_id`
WHERE `pi`.`purchase_id` = '37'
SELECT *
FROM `pos_purchase_payments`
WHERE `purchase_id` = '37'
ORDER BY `payment_date` ASC