app/Models/ReceiptTemplateModel.php

    public function getDefaultTemplate()
    {
        return $this->where('is_default', 1)->first() ?? $this->first();
---
SELECT *
FROM `receipt_templates`
WHERE `is_default` = 1
 LIMIT 1