app/Models/UserModel.php

SELECT `pos_roles`.*
FROM `pos_users`
JOIN `pos_roles` ON `pos_roles`.`id` = `pos_users`.`role_id`
WHERE `pos_users`.`id` = '1'
---
    public function getRole($userId)
    {
        return $this->db->table('pos_users')
            ->select('pos_roles.*')
            ->join('pos_roles', 'pos_roles.id = pos_users.role_id')
            ->where('pos_users.id', $userId)
            ->get()
            ->getRowArray();